import Foundation

public final class LettersInSquaresFilled: Format {
    public var name: String = "Letters in Squares (Filled)"
    public var id: String = "lettersInSquaresFilled"
    public var description: String = "Characters inside filled squares."

    let source =
        """
        abcdefghijklmnopqrstuvwxyzµßàáâãäåæçèéêëìíîïðñòóôõöøùúûüýþÿāăąćĉċčďđēĕėęěĝğġģĥħĩīĭįıĳĵķĸĺļľŀłńņňŉŋōŏő\
        œŕŗřśŝşšţťŧũūŭůűųŵŷźżžABCDEFGHIJKLMNOPQRSTUVWXYZΜSSÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞŸĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮIĲĴ\
        ĶĸĹĻĽĿŁŃŅŇʼNŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŹŻŽ
        """
    let formatted =
        """
        🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉µß🅰̀🅰🅰̂🅰̃🅰̈🅰̊æ🅲̧🅴̀🅴🅴̂🅴̈ı̀🅸🅸̂🅸̈ð🅽̃🅾̀🅾🅾̂🅾̃🅾̈ø🆄̀🆄🆄̂🆄̈🆈þ🆈̈🅰🅰̆🅰̨🅲🅲̂🅲̇🅲̌\
        🅳̌đ🅴🅴̆🅴̇🅴̨🅴̌🅶̂🅶̆🅶̇🅶̧🅷̂ħ🅸̃🅸🅸̆🅸̨ıĳ🅹̂🅺̧ĸ🅻🅻̧🅻̌🅻ł🅽🅽̧🅽̌ŉŋ🅾🅾̆🅾̋œ🆁🆁̧🆁̌🆂🆂̂🆂̧🆂̌🆃̧🆃̌ŧ🆄̃🆄🆄̆🆄̊🆄̋🆄̨🆆̂🆈̂🆉🆉̇🆉̌🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾\
        🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉Μ🆂🆂🅰̀🅰🅰̂🅰̃🅰̈🅰̊Æ🅲̧🅴̀🅴🅴̂🅴̈🅸̀🅸🅸̂🅸̈Ð🅽̃🅾̀🅾🅾̂🅾̃🅾̈Ø🆄̀🆄🆄̂🆄̈🆈Þ🆈̈🅰🅰̆🅰̨🅲🅲̂🅲̇🅲̌🅳̌Đ🅴🅴̆🅴̇🅴̨🅴̌🅶̂🅶̆🅶̇🅶̧🅷̂Ħ🅸̃🅸🅸̆🅸̨🅸Ĳ\
        🅹̂🅺̧ĸ🅻🅻̧🅻̌🅻Ł🅽🅽̧🅽̌ʼ🅽Ŋ🅾🅾̆🅾̋Œ🆁🆁̧🆁̌🆂🆂̂🆂̧🆂̌🆃̧🆃̌Ŧ🆄̃🆄🆄̆🆄̊🆄̋🆄̨🆆̂🆈̂🆉🆉̇🆉̌
        """

    public init() {}

    public func process(_ input: String) -> String {
        FontFormatter().process(input, source: source, formatted: formatted)
    }
}
